blur_kernel: list[list[float]] = [
    # усредненное размытие
    [1 / 9, 1 / 9, 1 / 9],
    [1 / 9, 1 / 9, 1 / 9],
    [1 / 9, 1 / 9, 1 / 9],
]

sharpness_kernel: list[list[float]] = [
    # резкость
    [0.0, -1.0, 0.0],
    [-1.0, 5.0, -1.0],
    [0.0, -1.0, 0.0],
]

emboss_kernel: list[list[float]] = [
    # теснение
    [-2.0, -1.0, 0.0],
    [-1.0, 1.0, 1.0],
    [0.0, 1.0, 2.0],
]

gaussian_blur: list[list[float]] = [
    # размытие по Гауссу
    [1 / 16, 2 / 16, 1 / 16],
    [2 / 16, 4 / 16, 2 / 16],
    [1 / 16, 2 / 16, 1 / 16],
]
highlighting_vertical_borders: list[list[float]] = [
    # выделение вертикальных границ
    [1.0, 0.0, -1.0],
    [1.0, 0.0, -1.0],
    [1.0, 0.0, -1.0],
]

highlighting_horizontal_borders: list[list[float]] = [
    # выделение горизотальных границ
    [1, 1, 1],
    [0, 0, 0],
    [-1, -1, -1],
]

box_blur_5x5: list[list[float]] = [
    # усредненное размытие 5x5
    [1 / 25, 1 / 25, 1 / 25, 1 / 25, 1 / 25],
    [1 / 25, 1 / 25, 1 / 25, 1 / 25, 1 / 25],
    [1 / 25, 1 / 25, 1 / 25, 1 / 25, 1 / 25],
    [1 / 25, 1 / 25, 1 / 25, 1 / 25, 1 / 25],
    [1 / 25, 1 / 25, 1 / 25, 1 / 25, 1 / 25],
]

gaussian_blur_5x5: list[list[float]] = [
    # размытие по Гауссу 5x5
    [1 / 256, 4 / 256, 6 / 256, 4 / 256, 1 / 256],
    [4 / 256, 16 / 256, 24 / 256, 16 / 256, 4 / 256],
    [6 / 256, 24 / 256, 36 / 256, 24 / 256, 6 / 256],
    [4 / 256, 16 / 256, 24 / 256, 16 / 256, 4 / 256],
    [1 / 256, 4 / 256, 6 / 256, 4 / 256, 1 / 256],
]
